<!-- dflook/terraform-github-actions {"workspace":"opentofu-exclude-support","backend_type":"remote","plan_modifier":"b0290c8150ae92d755bd7f79918a5400b47951132d040bb679259d282742cb6d","backend":"0bb2e82be9ff0391f13dc32005366c11a346967a5352aad80dc3cd1b9027b332","plan_job_ref":"Job Test actions using target, replace, and exclude #4 at https://github.com/dflook/terraform-github-actions/actions/runs/15543558654","plan_hash":"129c614ae19ef6fd13ad5998e0f03895072e222d357ff22b10f8ff080fab8526","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace-exclude__ in the __opentofu-exclude-support__ workspace
Targeting resources: `random_string.count[0]`
With variables: `length = 5`
<details>
<summary>Plan: 1 to add, 0 to change, 1 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] must be replaced
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      length      = 10 -> 5 # forces replacement
!~      result      = "**********" -> (known after apply)
#        (9 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
!~  count = "2SitXgPVlA" -> (known after apply)
╷
│ Warning: Resource targeting is in effect
│ 
│ You are creating a plan with the -target option, which means that the
│ result of this plan may not represent all of the changes requested by the
│ current configuration.
│ 		
│ The -target option is not for routine use, and is provided only for
│ exceptional situations such as recovering from errors or mistakes, or when
│ Terraform specifically suggests to use it as part of an error message.
╵
```
</details>

:memo: Plan generated in [Test actions using target, replace, and exclude #4](https://github.com/dflook/terraform-github-actions/actions/runs/15543558654)